fbiego/esp32-c3-mini/hal/esp32/app_hal.cpp
      const char *group_arr[20];
      int group_size = group.size();
      for (int j = 0; j < group_size && j < 20; j++)
      {
        group_arr[j] = group[j].as<const char *>();
      }

      add_item(face_custom_root, id, x, y, pvX, pvY, image.c_str(), group_arr, group_size);
    }

    return true;
  }
  else
  {
    Serial.println("Deserialize failed");
  }

  return false;
}

bool deleteCustomFace(String file)
{
  String path = file;
  if (!path.startsWith("/"))
  {
    path = "/" + path;
  }
  String read = readFile(path.c_str());
  JsonDocument face;
  DeserializationError err = deserializeJson(face, read);
  if (!err)
  {
    if (!face.containsKey("assets"))
    {
      return false;
    }

    JsonArray assets = face["assets"].as<JsonArray>();
    int sz = assets.size();

    for (int j = 0; j < sz; j++)
    {
      deleteFile(assets[j].as<const char *>());
    }

    deleteFile(path.c_str());

    return true;
  }
  else
  {
    Serial.println("Deserialize failed");
  }

  return false;
}

void registerCustomFace(const char *name, const lv_img_dsc_t *preview, lv_obj_t **watchface, String path)
{
  if (numFaces >= MAX_FACES)
  {
    return;
  }
  faces[numFaces].name = name;
  faces[numFaces].preview = preview;
  faces[numFaces].watchface = watchface;

  faces[numFaces].customIndex = customFaceIndex;
  faces[numFaces].custom = true;

  addWatchface(faces[numFaces].name, faces[numFaces].preview, numFaces);

  customFacePaths[customFaceIndex] = path;
  customFaceIndex++;

  Timber.i("Custom Watchface: %s registered at %d", name, numFaces);
  numFaces++;
}

void onCustomDelete(lv_event_t *e)
{
  int index = (int)lv_event_get_user_data(e);

  Serial.println("Delete custom watchface");
  Serial.println(customFacePaths[index]);
  showError("Delete", "The watchface will be deleted from storage, ESP32 will restart after deletion");
  if (deleteCustomFace(customFacePaths[index]))
  {
    lv_scr_load_anim(ui_appListScreen, LV_SCR_LOAD_ANIM_MOVE_RIGHT, 500, 0, false);
    ESP.restart();
  }
  else
  {
    showError("Error", "Failed to delete watchface");
  }
}

void addFaceList(lv_obj_t *parent, Face face)
{

  lv_obj_t *ui_faceItemPanel = lv_obj_create(parent);
  lv_obj_set_width(ui_faceItemPanel, 240);
  lv_obj_set_height(ui_faceItemPanel, 50);
  lv_obj_set_align(ui_faceItemPanel, LV_ALIGN_CENTER);
  lv_obj_clear_flag(ui_faceItemPanel, LV_OBJ_FLAG_SCROLLABLE); /// Flags
  lv_obj_set_style_radius(ui_faceItemPanel, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_color(ui_faceItemPanel, lv_color_hex(0xFFFFFF), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_bg_opa(ui_faceItemPanel, 0, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_color(ui_faceItemPanel, lv_color_hex(0xFFFFFF), LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_opa(ui_faceItemPanel, 255, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_width(ui_faceItemPanel, 1, LV_PART_MAIN | LV_STATE_DEFAULT);
  lv_obj_set_style_border_side(ui_faceItemPanel, LV_BORDER_SIDE_BOTTOM, LV_PART_MAIN | LV_STATE_DEFAULT);
  // lv_obj_set_style_bg_color(ui_faceItemPanel, lv_color_hex(0xFFFFFF), LV_PART_MAIN | LV_STATE_PRESSED);
  // lv_obj_set_style_bg_opa(ui_faceItemPanel, 100, LV_PART_MAIN | LV_STATE_PRESSED);

  lv_obj_t *ui_faceItemIcon = lv_img_create(ui_faceItemPanel);
  lv_img_set_src(ui_faceItemIcon, &ui_img_clock_png);
  lv_obj_set_width(ui_faceItemIcon, LV_SIZE_CONTENT);  /// 1
  lv_obj_set_height(ui_faceItemIcon, LV_SIZE_CONTENT); /// 1
  lv_obj_set_x(ui_faceItemIcon, 10);
  lv_obj_set_y(ui_faceItemIcon, 0);
  lv_obj_set_align(ui_faceItemIcon, LV_ALIGN_LEFT_MID);
  lv_obj_add_flag(ui_faceItemIcon, LV_OBJ_FLAG_ADV_HITTEST);  /// Flags
  lv_obj_clear_flag(ui_faceItemIcon, LV_OBJ_FLAG_SCROLLABLE); /// Flags

  lv_obj_t *ui_faceItemName = lv_label_create(ui_faceItemPanel);
  lv_obj_set_width(ui_faceItemName, 117);
  lv_obj_set_height(ui_faceItemName, LV_SIZE_CONTENT); /// 1
  lv_obj_set_x(ui_faceItemName, 50);
  lv_obj_set_y(ui_faceItemName, 0);
  lv_obj_set_align(ui_faceItemName, LV_ALIGN_LEFT_MID);
  lv_label_set_long_mode(ui_faceItemName, LV_LABEL_LONG_CLIP);
  if (face.custom)
  {
    lv_label_set_text(ui_faceItemName, customFacePaths[face.customIndex].c_str());
  }
  else
  {
    lv_label_set_text(ui_faceItemName, face.name);
  }

  lv_obj_set_style_text_font(ui_faceItemName, &lv_font_montserrat_16, LV_PART_MAIN | LV_STATE_DEFAULT);

  lv_obj_t *ui_faceItemDelete = lv_img_create(ui_faceItemPanel);
  lv_img_set_src(ui_faceItemDelete, &ui_img_bin_png);
  lv_obj_set_width(ui_faceItemDelete, LV_SIZE_CONTENT);  /// 1
  lv_obj_set_height(ui_faceItemDelete, LV_SIZE_CONTENT); /// 1
  lv_obj_set_x(ui_faceItemDelete, -10);
  lv_obj_set_y(ui_faceItemDelete, 0);
  lv_obj_set_align(ui_faceItemDelete, LV_ALIGN_RIGHT_MID);
  lv_obj_add_flag(ui_faceItemDelete, LV_OBJ_FLAG_CLICKABLE | LV_OBJ_FLAG_ADV_HITTEST); /// Flags
  lv_obj_clear_flag(ui_faceItemDelete, LV_OBJ_FLAG_SCROLLABLE);                        /// Flags
  lv_obj_set_style_radius(ui_faceItemDelete, 20, LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_bg_color(ui_faceItemDelete, lv_color_hex(0xF34235), LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_bg_opa(ui_faceItemDelete, 255, LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_border_color(ui_faceItemDelete, lv_color_hex(0xF34235), LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_border_opa(ui_faceItemDelete, 255, LV_PART_MAIN | LV_STATE_PRESSED);
  lv_obj_set_style_border_width(ui_faceItemDelete, 2, LV_PART_MAIN | LV_STATE_PRESSED);

  if (!face.custom)
  {
    lv_obj_add_flag(ui_faceItemDelete, LV_OBJ_FLAG_HIDDEN);
  }
  else
  {
    lv_obj_add_event_cb(ui_faceItemDelete, onCustomDelete, LV_EVENT_CLICKED, (void *)face.customIndex);
  }
}

void connectionCallback(bool state)
{
  Timber.d(state ? "Connected" : "Disconnected");
  if (state)
  {
    lv_obj_clear_state(ui_btStateButton, LV_STATE_CHECKED);
  }
  else
  {
    lv_obj_add_state(ui_btStateButton, LV_STATE_CHECKED);
  }
  lv_label_set_text_fmt(ui_appConnectionText, "Status\n%s", state ? "#19f736 Connected#" : "#f73619 Disconnected#");
}

