fbiego/esp32-c3-mini/hal/esp32/app_hal.cpp
    if (recv == cSize)
    { // received expected? if data chunk size equals chunk receive size then chunk is complete
      if (wSwitch)
      {
        wLen1 = cSize;
      }
      else
      {
        wLen2 = cSize;
      }

      wSwitch = !wSwitch;
      writeFile = true;

      pos++;
      uint8_t lst = last ? 0x01 : 0x00;
      uint8_t cmd[5] = {0xB0, 0x02, highByte(pos), lowByte(pos), lst};
      watch.sendCommand(cmd, 5); // notify the app that we received the chunk, this will trigger transfer of next chunk
    }

    if (last)
    {
    }
  }
#endif
}

void dataCallback(uint8_t *data, int length)
{
  // Serial.println("Received Data");
  // for (int i = 0; i < length; i++)
  // {
  //   Serial.printf("%02X ", data[i]);
  // }
  // Serial.println();
}

void logCallback(Level level, unsigned long time, String message)
{
  Serial.print(message);
}

void my_log_cb(const char *buf)
{
  Serial.write(buf, strlen(buf));
}

void loadSplash()
{
  int w = 122;
  int h = 130;
  int xOffset = 63;
  int yOffset = 55;
  tft.fillScreen(TFT_BLACK);
  screenBrightness(200);
  for (int y = 0; y < h; y++)
  {
    for (int x = 0; x < w; x++)
    {
      tft.writePixel(x + xOffset, y + yOffset, uint16_t(splash[(((y * w) + x) * 2)] << 8 | splash[(((y * w) + x) * 2) + 1]));
    }
  }

  delay(2000);
}

void hal_setup()
{

  Serial.begin(115200); /* prepare for possible serial debug */

  Timber.setLogCallback(logCallback);

  Timber.i("Starting up device");

  prefs.begin("my-app");

#ifdef ELECROW_C3
  Wire.begin(4, 5);
  init_IO_extender();
  delay(100);
  set_pin_io(2, true);
  set_pin_io(3, true);
  set_pin_io(4, true);
#endif

  tft.init();
  tft.initDMA();
  tft.startWrite();
  tft.fillScreen(TFT_BLACK);
  loadSplash();

  toneOut(TONE_EN * 2, 170);
  toneOut(TONE_FS * 2, 170);
  toneOut(TONE_GN * 2, 170);

  Serial.println(heapUsage());

  lv_init();

  lv_disp_draw_buf_init(&draw_buf, buf[0], buf[1], screenWidth * buf_size);

  /*Initialize the display*/
  static lv_disp_drv_t disp_drv;
  lv_disp_drv_init(&disp_drv);
  /*Change the following line to your display resolution*/
  disp_drv.hor_res = screenWidth;
  disp_drv.ver_res = screenHeight;
  disp_drv.flush_cb = my_disp_flush;
  disp_drv.draw_buf = &draw_buf;
  lv_disp_drv_register(&disp_drv);

  /*Initialize the (dummy) input device driver*/
  static lv_indev_drv_t indev_drv;
  lv_indev_drv_init(&indev_drv);
  indev_drv.type = LV_INDEV_TYPE_POINTER;
  indev_drv.read_cb = my_touchpad_read;
  lv_indev_drv_register(&indev_drv);

  lv_log_register_print_cb(my_log_cb);

  _lv_fs_init();

  ui_init();

  Serial.println(heapUsage());

  bool fsState = setupFS();
  if (fsState)
  {
    // driveList_cb(NULL);
    Serial.println("Setup FS success");
  }
  else
  {
    Serial.println("Setup FS failed");
    // showError(F_NAME, "Failed to mount the partition");
  }
  Serial.println(heapUsage());

  int wf = prefs.getInt("watchface", 0);
  String custom = prefs.getString("custom", "");
  if (wf >= numFaces)
  {
    wf = 0; // default
  }
  currentIndex = wf;
  if (custom != "" && fsState && loadCustomFace(custom))
  {
    ui_home = face_custom_root;
  }
  else
  {
    ui_home = *faces[wf].watchface; // load saved watchface power on
  }
  lv_disp_load_scr(ui_home);

  watch.setConnectionCallback(connectionCallback);
  watch.setNotificationCallback(notificationCallback);
  watch.setConfigurationCallback(configCallback);
  watch.setRingerCallback(ringerCallback);
  watch.setDataCallback(dataCallback);
  watch.setRawDataCallback(rawDataCallback);
  watch.begin();
  watch.set24Hour(true);
  watch.setBattery(85);

  String about = String(ui_info_text) + "\nESP32 C3 Mini\n" + watch.getAddress();
  lv_label_set_text(ui_aboutText, about.c_str());

  // bool intro = prefs.getBool("intro", true);

  // if (intro)
  // {
  //   showAlert();
  //   prefs.putBool("intro", false);
  // }
  // else
  // {
  //   lv_obj_add_flag(ui_alertPanel, LV_OBJ_FLAG_HIDDEN);
  // }

  // load saved preferences
  int tm = prefs.getInt("timeout", 0);
  int br = prefs.getInt("brightness", 100);
  circular = prefs.getBool("circular", false);
  alertSwitch = prefs.getBool("alerts", false);

  lv_obj_scroll_to_y(ui_settingsList, 1, LV_ANIM_ON);
  lv_obj_scroll_to_y(ui_appList, 1, LV_ANIM_ON);
  lv_obj_scroll_to_y(ui_appInfoPanel, 1, LV_ANIM_ON);
  lv_obj_scroll_to_y(ui_gameList, 1, LV_ANIM_ON);

  if (tm > 4)
  {
    tm = 4;
  }
  else if (tm < 0)
  {
    tm = 0;
  }

  screenBrightness(br);

  lv_dropdown_set_selected(ui_timeoutSelect, tm);
  lv_slider_set_value(ui_brightnessSlider, br, LV_ANIM_OFF);
  if (circular)
  {
    lv_obj_add_state(ui_Switch2, LV_STATE_CHECKED);
  }
  else
  {
    lv_obj_clear_state(ui_Switch2, LV_STATE_CHECKED);
  }
  if (alertSwitch)
  {
    lv_obj_add_state(ui_alertStateSwitch, LV_STATE_CHECKED);
  }
  else
  {
    lv_obj_clear_state(ui_alertStateSwitch, LV_STATE_CHECKED);
  }

  screenTimer.active = true;
  screenTimer.time = millis();

  setTimeout(tm);

  // if (!fsState){
  //   showError(F_NAME, "Failed to mount the partition");
  // }

  if (lv_fs_is_ready('S'))
  {
    Serial.println("Drive S is ready");
  }
  else
  {
    Serial.println("Drive S is not ready");
  }

#ifdef ENABLE_APP_QMI8658C

  qmi8658_result = qmi8658c.open(&qmi8658_cfg);
  delay(100); // Delay for sensor initialization
  ui_imu_set_info(qmi8658_result == qmi8658_result_open_success, qmi8658c.deviceID, qmi8658c.deviceRevisionID);

  // showError("IMU State", qmi8658c.resultToString(qmi8658_result));

#endif

#ifdef ENABLE_RTC
  Rtc.Begin();

  if (!Rtc.GetIsRunning())
  {
    uint8_t error = Rtc.LastError();
    if (error != 0)
    {
      showError("RTC", "Error on RTC");
    }
    Rtc.SetIsRunning(true);
  }

  RtcDateTime now = Rtc.GetDateTime();

  watch.setTime(now.Second(), now.Minute(), now.Hour(), now.Day(), now.Month(), now.Year());

  Rtc.StopAlarm();
  Rtc.StopTimer();
  Rtc.SetSquareWavePin(PCF8563SquareWavePinMode_None);
#endif

  Timber.i("Setup done");
  Timber.i(about);
}

void hal_loop()
{

  if (!transfer)
  {

#ifdef ENABLE_APP_QMI8658C
    if (qmi8658c_active)
    {
      delay(10);
      qmi8658c.read(&data); // Read sensor data from QMI8658C sensor
      ui_imu_update_acc(data.acc_xyz.x, data.acc_xyz.y, data.acc_xyz.z);
      ui_imu_update_gyro(data.gyro_xyz.x, data.gyro_xyz.y, data.gyro_xyz.z);
      ui_imu_update_temp(data.temperature);
    }
#endif

    lv_timer_handler(); /* let the GUI do its work */
    delay(5);
    watch.loop();

    if (ui_home == ui_clockScreen)
    {
      lv_label_set_text(ui_hourLabel, watch.getHourZ().c_str());
      lv_label_set_text(ui_dayLabel, watch.getTime("%A").c_str());
      lv_label_set_text(ui_minuteLabel, watch.getTime("%M").c_str());
      lv_label_set_text(ui_dateLabel, watch.getTime("%d\n%b").c_str());
      lv_label_set_text(ui_amPmLabel, watch.getAmPmC(false).c_str());
    }
    else
    {
      update_faces();
    }

    lv_disp_t *display = lv_disp_get_default();
    lv_obj_t *actScr = lv_disp_get_scr_act(display);
    if (actScr != ui_home)
    {
    }

    if (actScr == ui_appInfoScreen)
    {
      lv_label_set_text_fmt(ui_appBatteryText, "Battery - %d%%", watch.getPhoneBattery());
      lv_bar_set_value(ui_appBatteryLevel, watch.getPhoneBattery(), LV_ANIM_OFF);
      if (watch.isPhoneCharging())
      {
        lv_img_set_src(ui_appBatteryIcon, &ui_img_battery_plugged_png);
      }
      else
      {
        lv_img_set_src(ui_appBatteryIcon, &ui_img_battery_state_png);
      }
    }

