fbiego/esp32-c3-mini/hal/esp32/app_hal.cpp
    if (alertTimer.active)
    {
      if (alertTimer.time + alertTimer.duration < millis())
      {
        alertTimer.active = false;
        lv_obj_add_flag(ui_alertPanel, LV_OBJ_FLAG_HIDDEN);
      }
    }

    if (screenTimer.active)
    {
      uint8_t lvl = lv_slider_get_value(ui_brightnessSlider);
      screenBrightness(lvl);

      if (screenTimer.duration < 0)
      {
        // Timber.w("Always On active");
        screenTimer.active = false;
      }
      else if (watch.isCameraReady())
      {
        screenTimer.active = false;
      }
      else if (screenTimer.time + screenTimer.duration < millis())
      {
        Timber.w("Screen timeout");
        screenTimer.active = false;

        screenBrightness(0);
        lv_disp_load_scr(ui_home);
      }
    }
  }

#ifdef ENABLE_CUSTOM_FACE
  if (writeFile && transfer)
  {
    if (start)
    {
      screenBrightness(200);
      tft.fillScreen(TFT_BLUE);

      tft.drawRoundRect(70, 120, 100, 20, 5, TFT_WHITE);
    }

    writeFile = false;

    File file = FLASH.open(fName, start ? FILE_WRITE : FILE_APPEND);
    if (file)
    {

      if (!wSwitch)
      {
        file.write(buf1, wLen1);
      }
      else
      {
        file.write(buf2, wLen2);
      }

      file.close();

      // Serial.print(last ? "Complete: " :  "");
      // Serial.print("Receieved ");
      // Serial.print(currentRecv);
      // Serial.print("/");
      // Serial.print(total);
      // Serial.print("   ");
      // Serial.println(hexString(cmd, 5, true, "-"));

      if (total > 0)
      {
        int progress = (100 * currentRecv) / total;

        // Serial.println(String(progress, 2) + "%");
        tft.setTextColor(TFT_WHITE, TFT_BLUE);
        tft.setTextSize(2);
        tft.setCursor(80, 80);
        tft.print(progress);
        tft.print("%");

        tft.fillRoundRect(70, 120, progress, 20, 5, TFT_WHITE);
      }

      if (last)
      {
        // the file transfer has ended
        transfer = false;

        tft.setTextColor(TFT_WHITE, TFT_BLUE);
        tft.setTextSize(2);
        tft.setCursor(60, 80);
        tft.print("Processing");

        parseDial(fName.c_str()); // process the file
      }
    }
    else
    {
      Serial.println("- failed to open file for writing");

      transfer = false;

      ESP.restart();
    }
  }

#endif
}

bool isDay()
{
  return watch.getHour(true) > 7 && watch.getHour(true) < 21;
}

void update_faces()
{
  int second = watch.getSecond();
  int minute = watch.getMinute();
  int hour = watch.getHourC();
  bool mode = watch.is24Hour();
  bool am = watch.getHour(true) < 12;
  int day = watch.getDay();
  int month = watch.getMonth() + 1;
  int year = watch.getYear();
  int weekday = watch.getDayofWeek();

  int temp = watch.getWeatherAt(0).temp;
  int icon = watch.getWeatherAt(0).icon;

  int battery = watch.getPhoneBattery();
  bool connection = watch.isConnected();

  int steps = 2735;
  int distance = 17;
  int kcal = 348;
  int bpm = 76;
  int oxygen = 97;

  if (ui_home == face_custom_root)
  {
    update_time_custom(second, minute, hour, mode, am, day, month, year, weekday);
  }
  else
  {

    ui_update_watchfaces(second, minute, hour, mode, am, day, month, year, weekday,
                         temp, icon, battery, connection, steps, distance, kcal, bpm, oxygen);
  }
}

bool readDialBytes(const char *path, uint8_t *data, size_t offset, size_t size)
{
  File file = FLASH.open(path, "r");
  if (!file)
  {
    Serial.println("Failed to open file for reading");
    return false;
  }

  if (!file.seek(offset))
  {
    Serial.println("Failed to seek file");
    file.close();
    return false;
  }

  int bytesRead = file.readBytes((char *)data, size);

  if (bytesRead <= 0)
  {
    Serial.println("Error reading file");
    file.close();
    return false;
  }

  file.close();
  return true;
}

bool isKnown(uint8_t id)
{
  if (id < 0x1E)
  {
    if (id != 0x04 || id != 0x05 || id != 0x12 || id != 0x18 || id != 0x20)
    {
      return true;
    }
  }
  else
  {
    if (id == 0xFA || id == 0xFD)
    {
      return true;
    }
  }
  return false;
}

String hexString(uint8_t *arr, size_t len, bool caps, String separator)
{
  String hexString = "";
  for (size_t i = 0; i < len; i++)
  {
    char hex[3];
    sprintf(hex, caps ? "%02X" : "%02x", arr[i]);
    hexString += separator;
    hexString += hex;
  }
  return hexString;
}

String longHexString(unsigned long l)
{
  char buffer[9];             // Assuming a 32-bit long, which requires 8 characters for hex representation and 1 for null terminator
  sprintf(buffer, "%08x", l); // Format as 8-digit hex with leading zeros
  return String(buffer);
}

void parseDial(const char *path)
{

#ifdef ENABLE_CUSTOM_FACE
  String name = longHexString(watch.getEpoch());

  Serial.print("Parsing dial:");
  Serial.println(path);

  JsonDocument json;
  JsonDocument elements;
  JsonDocument assetFiles;
  JsonArray elArray = elements.to<JsonArray>();
  JsonArray assetArray = assetFiles.to<JsonArray>();

  json["name"] = name;
  json["file"] = String(path);

  JsonDocument rsc;
  int errors = 0;

  uint8_t az[1];
  if (!readDialBytes(path, az, 0, 1))
  {
    Serial.println("Failed to read watchface header");
    errors++;
  }
  uint8_t j = az[0];

  static uint8_t item[20];
  static uint8_t table[512];

  uint8_t lid = 0;
  int a = 0;
  int lan = 0;
  int tp = 0;
  int wt = 0;

  for (int i = 0; i < j; i++)
  {
    if (i >= 60)
    {
      Serial.println("Too many watchface elements >= 60");
      break;
    }

    JsonDocument element;

    if (!readDialBytes(path, item, (i * 20) + 4, 20))
    {
      Serial.println("Failed to read element properties");
      errors++;
    }

    uint8_t id = item[0];

    element["id"] = id;

    uint16_t xOff = item[5] * 256 + item[4];
    uint16_t yOff = item[7] * 256 + item[6];

    element["x"] = xOff;
    element["y"] = yOff;

    uint16_t xSz = item[9] * 256 + item[8];
    uint16_t ySz = item[11] * 256 + item[10];

    uint32_t clt = item[15] * 256 * 256 * 258 + item[14] * 256 * 256 + item[13] * 256 + item[12];
    uint32_t dat = item[19] * 256 * 256 * 256 + item[18] * 256 * 256 + item[17] * 256 + item[16];

